results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod1-compnone-trial2/producer-perf-1.log
producer_index=1
producer_count=1
producer_records=100000
producer_throughput=10000
25583 records sent, 5116.6 records/sec (49.97 MB/sec), 240.5 ms avg latency, 1186.0 ms max latency.
55079 records sent, 11011.4 records/sec (107.53 MB/sec), 11.1 ms avg latency, 68.0 ms max latency.
100000 records sent, 8651.267411 records/sec (84.49 MB/sec), 69.98 ms avg latency, 1186.00 ms max latency, 9 ms 50th, 451 ms 95th, 941 ms 99th, 1066 ms 99.9th.